---
kind: other
id: Methods.T:Autodesk.Revit.DB.AssemblyInstance
source: html/dde6c943-5c56-b0e6-b82a-7a6d24bc3c20.htm
---
# AssemblyInstance Methods

Adds member element ids for the assembly instance.